#include <iostream>
using namespace std;
int main(){
  cout<<"1-ый модуль сортирует динамический массив пузырьковой сортировкой,\n а также встроенной функцией sort и вычисляет время каждой сортировки"<<endl;
  cout<<"=================================================================="<<endl;
  cout<<"2-ой модуль шифрует и  дешифровывает строку методом перестановки.\nПри шифровании перестановкой символы  шифруемого текста переставляются \n по определенным правилам внутри шифруемого блока этого текста"<<endl;
  cout<<"=================================================================="<<endl;
  cout<<"3-ий модуль считает t1 и t2 для определённых выражений.\nПри этом параметры x и y вводятся пользователем с клавиатуры.\nНа каждой итерации x и у увеличиваются на 1, при этом t1 и t2 считается заново\nНа выходе мы получаем файл Value.txt и Value.csv co значениями t1 и t2"<<endl;
  cout<<"=================================================================="<<endl;
  cout<<"4-ый модуль демонстрирует  битовые операции \nна примере распаковки и упаковки слова состояния аппаратуры.\nЭлементы машинного слова, а также его отдельные составные части \nдолжны  запрашиваться  у  пользователя."<<endl;

}
