#include <iostream>
using namespace std;
int main(){
  cout<<"\033[1;31mВыберите модуль, который вас интересует: \033[0m"<<endl;
  cout<<"1.Модуль,демонстрирующий частоту встречания символов в тексте"<<endl;
  cout<<"2.Модуль математических операций с построением графиков"<<endl;
  cout<<"3.Модуль шифрования файла."<<endl;
  cout<<"4.Модуль расшифрования файла"<<endl;
  cout<<"5.Модуль шифрования и дешифровки при помощи омофонического шифра"<<endl;
  cout<<"6.Модуль шифрования и дешифровки при помощи RSA шифра"<<endl;
  cout<<"7.Справочная информация по каждому из модулей"<<endl;
  cout<<"8.Сменить пароль для суперпользователя"<<endl;
  cout<<"\033[1;31m====================================================\033[0m"<<endl;
}
