#include <iostream>
using namespace std;
int main(){
  cout<<"\033[1;31mВыберите модуль, который вас интересует: \033[0m"<<endl;
  cout<<"1.Модуль сортировки массива чисел"<<endl;
  cout<<"2.Модуль шифрования и дешифровки по алгоритму перестановки"<<endl;
  cout<<"3.Модуль математических вычислений."<<endl;
  cout<<"4.Модуль, демонстрирующий битовые операции."<<endl;
  cout<<"5.Справочная информация по каждому из модулей"<<endl;
  cout<<"\033[1;31m====================================================\033[0m"<<endl;
}
