#include <iostream>
using namespace std;
int main(){
  cout<<"\033[1;34m-math\033[0m  - простой математический модуль"<<endl;
  cout<<"\033[1;34m-chastota\033[0m  - частота встречания символов в файле 1.txt"<<endl;
  cout<<"\033[1;34m-arr\033[0m  - сортировка динамического массива,а также встроенной функцией sort()"<<endl;
  cout<<"\033[1;34m-m sl\033[0m  - более усовершенствованный математический модуль"<<endl;
  cout<<"\033[1;34m-om_sh\033[0m  -омофомический шифр"<<endl;
  cout<<"\033[1;34m-p_sh\033[0m  - шифрование методом перестановки"<<endl;
  cout<<"\033[1;34m-r_file\033[0m  - расшифровка файла при помощи частотного анализа"<<endl;
  cout<<"\033[1;34m-s_i_a\033[0m  - синтез и анализ словосостояния"<<endl;
  cout<<"\033[1;34m-xor\033[0m  - XOR шифрование"<<endl;
  cout<<"\033[1;34m-zesar\033[0m  -шифрование методом цезаря"<<endl;
  cout<<"\033[1;34m-z_file\033[0m  - зашифровка файла методом перестановки"<<endl;
  cout<<"\033[1;34m-rsa\033[0m  - RSA шифрование"<<endl;
}
